Revit 2027 API
ForgeTypeId Constructor
Overload List
Name | Description
ForgeTypeId() |  Constructs a ForgeTypeId holding an empty schema identifier.
ForgeTypeId(String) |  Constructs a ForgeTypeId holding the given schema identifier.
Top
See Also
Reference
ForgeTypeId Class
Autodesk.Revit.DB Namespace